#+PROPERTY:  header-args :session *R* :tangle ../docs/R/animation.R :eval no-export
#+OPTIONS: ^:nil
#+BIND: org-export-latex-image-default-option "height=0.4\\textheight"


#+begin_src R :exports none :tangle no
setwd('~/github/bookvis')
#+end_src

#+begin_src R :exports none  
##################################################################
## Initial configuration
##################################################################
## Clone or download the repository and set the working directory
## with setwd to the folder where the repository is located.

Sys.setlocale("LC_TIME", 'C')
#+end_src

** Data
#+begin_src R :exports none
##################################################################
## Data
##################################################################
#+end_src

The daily solar radiation CM-SAF data (chapter ref:cha:rasterST) do
not meet the condition of a smooth transition between layers. The
changes between the consecutive snapshots of daily radiation are too
abrupt to be glued one after another. We will work with a different
dataset in this section.

The THREDSS server[fn:1] of Meteogalicia[fn:2] provides access
through different protocols to the output of a Weather Research
and Forecasting (WRF) model, a mesoscale numerical weather
prediction system. Among the set of available variables we will
use the forecast of hourly cloud cover at low and mid levels. This
space-time raster has a time horizon of 96 hours and a spatial
resolution of 12 kilometers.

#+INDEX: Packages!raster@\texttt{raster}
#+INDEX: Packages!rasterVis@\texttt{rasterVis}

#+INDEX: Data!Cloud cover
#+INDEX: Data!MeteoGalicia
#+INDEX: Subjects!Data processing and cleaning

#+begin_src R
library(raster)
library(rasterVis)

cft <- brick('data/cft_20130417_0000.nc')
## set projection
projLCC2d <- "+proj=lcc +lon_0=-14.1 +lat_0=34.823 +lat_1=43 +lat_2=43 +x_0=536402.3 +y_0=-18558.61 +units=km +ellps=WGS84"
projection(cft) <- projLCC2d
##set time index
timeIndex <- seq(as.POSIXct('2013-04-17 01:00:00', tz = 'UTC'), length = 96, by = 'hour')
cft <- setZ(cft, timeIndex)
names(cft) <- format(timeIndex, 'D%d_H%H')
#+end_src

#+begin_src R :results output :exports results :tangle no
cft
#+end_src

#+RESULTS:
: class       : RasterBrick 
: dimensions  : 99, 99, 9801, 96  (nrow, ncol, ncell, nlayers)
: resolution  : 12, 12  (x, y)
: extent      : 858, 2046, -6, 1182  (xmin, xmax, ymin, ymax)
: coord. ref. : +proj=lcc +lon_0=-14.1 +lat_0=34.823 +lat_1=43 lat_2=43 +x_0=536402.3 +y_0=-18558.61 +units=km +ellps=WGS84 
: data source : /home/oscar/github/bookvis/data/cft_20130417_0000.nc 
: names       : D17_H01, D17_H02, D17_H03, D17_H04, D17_H05, D17_H06, D17_H07, D17_H08, D17_H09, D17_H10, D17_H11, D17_H12, D17_H13, D17_H14, D17_H15, ... 
: time        : 2013-04-17 01:00:00, 2013-04-21 00:00:00 (min, max)
: varname     : cft


*** Define the locations

Once the Earth is represented with the sphere and the superimposed
image, the fly-by animation is defined with a set of locations to be
visited:

#+begin_src R
cities <- rbind(c('Madrid', 'Spain'),
                c('Tokyo', 'Japan'),
                c('Sidney', 'Australia'),
                c('Sao Paulo', 'Brazil'),
                c('New York', 'USA'))
cities <- as.data.frame(cities)
names(cities) <- c("city", "country")
#+end_src

The latitude and longitude coordinates of these cities can be obtained
through the Nominatim service of OpenStreetMap. An auxiliary function,
=geocode=, obtains this information using the =XML= package.

#+INDEX: Packages!XML@\texttt{XML}
#+INDEX: Subjects!Web scraping
#+INDEX: Data!OpenStreetMap

#+begin_src R
library(XML)

geocode <- function(x){
    city <- x[1]
    country <- x[2]
    urlOSM <- paste0('http://nominatim.openstreetmap.org/search?',
                     'city=', city,
                     '&country=', country,
                     '&format=xml')
    ## Parse the webpage
    xmlOSM <- xmlParse(urlOSM)
    ## Use only the first result
    cityOSM <- getNodeSet(xmlOSM, '//place')[[1]]
    ## Extract attributes: longitude...
    lon <- xmlGetAttr(cityOSM, 'lon')
    ## and latitude
    lat <- xmlGetAttr(cityOSM, 'lat')
    ## Return them as a vector
    as.numeric(c(lon, lat))
}

points <- apply(cities, 1, geocode)
points <- t(points)
colnames(points) <- c("lon", "lat")

cities <- cbind(cities, points)
#+end_src

#+RESULTS:
  | Madrid    | Spain     |  -3.7035825 |  40.4167047 |
  | Tokyo     | Japan     | 139.7589667 |  35.6828378 |
  | Sidney    | Australia | 151.2164539 | -33.8548157 |
  | Sao Paulo | Brazil    | -46.6333824 | -23.5506507 |
  | New York  | USA       | -87.2008048 |  30.8385202 |

*** Generate the route 

The next step computes the intermediate points between each pair of
locations. The =geosphere= package provides the =gcIntermediate=
function for this task:

#+INDEX: Packages!geosphere@\texttt{geosphere}
#+INDEX: Subjects!Data processing and cleaning

#+begin_src R
library(geosphere)

## When arriving or departing include a progressive zoom with 100
## frames
zoomIn <- seq(.3, .1, length = 100)
zoomOut <- seq(.1, .3, length = 100)

## First point of the route
route <- data.frame(lon = cities[1, "lon"],
                    lat = points[1, "lat"],
                    zoom = zoomIn,
                    name = cities[1, "city"],
                    action = 'arrive')

## This loop visits each location included in the 'points' set
## generating the route.
for (i in 1:(nrow(cities) - 1)) {

    p1 <- cities[i,]
    p2 <- cities[i + 1,] 
    ## Initial location
    departure <- data.frame(lon = p1$lon,
                            lat = p1$lat,
                            zoom = zoomOut,
                            name = p1$city,
                            action = 'depart')

    ## Travel between two points: Compute 100 points between the
    ## initial and the final locations.
    routePart <- gcIntermediate(p1[, c("lon", "lat")],
                                p2[, c("lon", "lat")],
                                n = 100)
    routePart <- data.frame(routePart)
    routePart$zoom <- 0.3
    routePart$name <- ''
    routePart$action <- 'travel'

    ## Final location
    arrival <- data.frame(lon = p2$lon,
                          lat = p2$lat,
                          zoom = zoomIn,
                          name = p2$city,
                          action = 'arrive')
    ## Complete route: initial, intermediate, and final locations.
    routePart <- rbind(departure, routePart, arrival)
    route <- rbind(route, routePart)
}
#+end_src

#+RESULTS:

#+begin_src R :results output :exports both
## Close the travel
route <- rbind(route,
               data.frame(lon = cities[i + 1, "lon"],
                          lat = cities[i + 1, "lat"],
                          zoom = zoomOut,
                          name = cities[i+1, "city"],
                          action = 'depart'))

summary(route)
#+end_src

#+RESULTS:
#+begin_example
      lon                lat               zoom               name    
 Min.   :-179.538   Min.   :-74.346   Min.   :0.1000   Madrid   :300  
 1st Qu.: -54.003   1st Qu.:-23.551   1st Qu.:0.1707   New York :400  
 Median :  -3.704   Median : 25.285   Median :0.2434   Sao Paulo:400  
 Mean   :  32.888   Mean   :  6.293   Mean   :0.2296   Sidney   :400  
 3rd Qu.: 139.759   3rd Qu.: 35.683   3rd Qu.:0.3000   Tokyo    :400  
 Max.   : 178.515   Max.   : 68.234   Max.   :0.3000            :800  
    action    
 arrive: 900  
 depart:1000  
 travel: 800
#+end_example

